In [7]:

!pip install pandas
import pandas as pd

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in /Users/erikahartai/Library/Python/3.14/lib/python/site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in /Users/erikahartai/Library/Python/3.14/lib/python/site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/erikahartai/Library/Python/3.14/lib/python/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Users/erikahartai/Library/Python/3.14/lib/python/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /Users/erikahartai/Library/Python/3.14/lib/python/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /Users/erikahartai/Library/Python/3.14/lib/python/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [8]:
df2 = pd.DataFrame([('Foreign Cinema', 'Restaurant', 289.0),
                   ('Liho Liho', 'Restaurant', 224.0),
                   ('500 Club', 'bar', 80.5),
                   ('The Square', 'bar', 25.30)],
           columns=('name', 'type', 'AvgBill')
                 )
df2

             name        type  AvgBill
0  Foreign Cinema  Restaurant    289.0
1       Liho Liho  Restaurant    224.0
2        500 Club         bar     80.5
3      The Square         bar     25.3

In [9]:
df2['Day'] = "Monday" # Como un diccionario
df2

             name        type  AvgBill     Day
0  Foreign Cinema  Restaurant    289.0  Monday
1       Liho Liho  Restaurant    224.0  Monday
2        500 Club         bar     80.5  Monday
3      The Square         bar     25.3  Monday

In [10]:

#Vamos a usar el método insert
df2.insert(loc=1, column="Stars", value=[2,2,3,4])
df2

             name  Stars        type  AvgBill     Day
0  Foreign Cinema      2  Restaurant    289.0  Monday
1       Liho Liho      2  Restaurant    224.0  Monday
2        500 Club      3         bar     80.5  Monday
3      The Square      4         bar     25.3  Monday

In [11]:
df2["AvgBillIVA"] = df2["AvgBill"]*1.21
df2

             name  Stars        type  AvgBill     Day  AvgBillIVA
0  Foreign Cinema      2  Restaurant    289.0  Monday     349.690
1       Liho Liho      2  Restaurant    224.0  Monday     271.040
2        500 Club      3         bar     80.5  Monday      97.405
3      The Square      4         bar     25.3  Monday      30.613

In [12]:
df3 = df2.assign(AvgHalfBill=df2.AvgBill / 2, Michelin_Star=3)
df3

df3["HOLA"] = df3.name.str.capitalize()
df3

,name,Stars,type,AvgBill,Day,AvgBillIVA,AvgHalfBill,Michelin_Star,HOLA
0,Foreign Cinema,2,Restaurant,289.0,Monday,349.690,144.50,3,Foreign cinema
1,Liho Liho,2,Restaurant,224.0,Monday,271.040,112.00,3,Liho liho
2,500 Club,3,bar,80.5,Monday,97.405,40.25,3,500 club
3,The Square,4,bar,25.3,Monday,30.613,12.65,3,The square

In [13]:
df3.drop(columns=["Stars"],inplace=True) # Eliminamos la última columna que hemos creado

In [14]:
df3

,name,type,AvgBill,Day,AvgBillIVA,AvgHalfBill,Michelin_Star,HOLA
0,Foreign Cinema,Restaurant,289.0,Monday,349.690,144.50,3,Foreign cinema
1,Liho Liho,Restaurant,224.0,Monday,271.040,112.00,3,Liho liho
2,500 Club,bar,80.5,Monday,97.405,40.25,3,500 club
3,The Square,bar,25.3,Monday,30.613,12.65,3,The square

In [19]:
df_less_rows = df_no_michelin.drop([1,3])
df_less_rows

NameError: name 'df_no_michelin' is not defined

In [22]:
dfs1 = df3[df3.Michelin_Star>=3] # per una selecció?
dfs1

,name,type,AvgBill,Day,AvgBillIVA,AvgHalfBill,Michelin_Star,HOLA
0,Foreign Cinema,Restaurant,289.0,Monday,349.690,144.50,3,Foreign cinema
1,Liho Liho,Restaurant,224.0,Monday,271.040,112.00,3,Liho liho
2,500 Club,bar,80.5,Monday,97.405,40.25,3,500 club
3,The Square,bar,25.3,Monday,30.613,12.65,3,The square

In [23]:
df3[df3.Michelin_Star>=3].index

RangeIndex(start=0, stop=4, step=1)

In [24]:
df3.drop(df3[df3.Michelin_Star>=3].index, inplace=True) #Alerta con la integración de los cambios
df3

Empty DataFrame
Columns: [name, type, AvgBill, Day, AvgBillIVA, AvgHalfBill, Michelin_Star, HOLA]
Index: []

In [ ]:
#Concatenación y unión de dataframes

In [25]:
df1 = pd.DataFrame([('Foreign Cinema', 'Restaurant', 289.0),
                   ('Liho Liho', 'Restaurant', 224.0),
                   ('500 Club', 'bar', 80.5),
                   ('The Square', 'bar', 25.30)],
           columns=('name', 'type', 'AvgBill')
                 )
df1

             name        type  AvgBill
0  Foreign Cinema  Restaurant    289.0
1       Liho Liho  Restaurant    224.0
2        500 Club         bar     80.5
3      The Square         bar     25.3

In [27]:
df2 = pd.DataFrame([('Biels', 'Quiosquet', 389.0),
                   ('Barkus', 'Bar', 24.0),
                   ('Blue Wall', 'bar', 80.5),
                   ('Bounty Hunters', 'Social Club', 125.30)],
           columns=('name2', 'type', 'AvgBill')
                 )
df2

            name2         type  AvgBill
0           Biels    Quiosquet    389.0
1          Barkus          Bar     24.0
2       Blue Wall          bar     80.5
3  Bounty Hunters  Social Club    125.3

In [28]:
dfAll = pd.concat([df1,df2])
dfAll

             name         type  AvgBill           name2
0  Foreign Cinema   Restaurant    289.0             NaN
1       Liho Liho   Restaurant    224.0             NaN
2        500 Club          bar     80.5             NaN
3      The Square          bar     25.3             NaN
0             NaN    Quiosquet    389.0           Biels
1             NaN          Bar     24.0          Barkus
2             NaN          bar     80.5       Blue Wall
3             NaN  Social Club    125.3  Bounty Hunters

In [29]:
dfAll = dfAll.reset_index()
dfAll

   index            name         type  AvgBill           name2
0      0  Foreign Cinema   Restaurant    289.0             NaN
1      1       Liho Liho   Restaurant    224.0             NaN
2      2        500 Club          bar     80.5             NaN
3      3      The Square          bar     25.3             NaN
4      0             NaN    Quiosquet    389.0           Biels
5      1             NaN          Bar     24.0          Barkus
6      2             NaN          bar     80.5       Blue Wall
7      3             NaN  Social Club    125.3  Bounty Hunters

In [30]:
# https://pandas.pydata.org/docs/reference/api/pandas.concat.html
dfAll = pd.concat([df1,df2],ignore_index=True)
dfAll

             name         type  AvgBill           name2
0  Foreign Cinema   Restaurant    289.0             NaN
1       Liho Liho   Restaurant    224.0             NaN
2        500 Club          bar     80.5             NaN
3      The Square          bar     25.3             NaN
4             NaN    Quiosquet    389.0           Biels
5             NaN          Bar     24.0          Barkus
6             NaN          bar     80.5       Blue Wall
7             NaN  Social Club    125.3  Bounty Hunters

In [31]:
df1 = pd.DataFrame([('Jhon', 1, "Italy"),
                   ('Pep', 2, "Germany"),
                   ('William', 3, "Finland"),
                   ('Snake', 4, "Italy")],
           columns=('name', 'ID', 'Country')
                 )
df1

      name  ID  Country
0     Jhon   1    Italy
1      Pep   2  Germany
2  William   3  Finland
3    Snake   4    Italy

In [32]:
df2 = pd.DataFrame([(1, 145.0, 3000.1),
                   ( 2, 189.2, 2030.2),
                   ( 3, 129.0, 3000.0),
                   ( 4, 198.1, 4020.2)],
           columns=('DNI', 'Weight', 'Salary')
                 )
df2

   DNI  Weight  Salary
0    1   145.0  3000.1
1    2   189.2  2030.2
2    3   129.0  3000.0
3    4   198.1  4020.2

In [33]:
# https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html

df1.merge(df2) ## ALERTA ! Necesita más parametros

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [34]:
df1.merge(df2, left_on='ID', right_on='DNI')

      name  ID  Country  DNI  Weight  Salary
0     Jhon   1    Italy    1   145.0  3000.1
1      Pep   2  Germany    2   189.2  2030.2
2  William   3  Finland    3   129.0  3000.0
3    Snake   4    Italy    4   198.1  4020.2

In [35]:
df2 = pd.DataFrame([(1, 145.0, 3000.1), #No 2
                   ( 3, 129.0, 3000.0), # Multiples 3
                   ( 3, 159.0, 4000.0),
                   ( 3, 109.0, 5000.0),
                   ( 4, 198.1, 4020.2),
                   ( 5, 200.0, 5000.2)], #a new one
           columns=('DNI', 'Weight', 'Salary')
                 )
df2

   DNI  Weight  Salary
0    1   145.0  3000.1
1    3   129.0  3000.0
2    3   159.0  4000.0
3    3   109.0  5000.0
4    4   198.1  4020.2
5    5   200.0  5000.2

In [36]:
df1.merge(df2, left_on='ID', right_on='DNI')

      name  ID  Country  DNI  Weight  Salary
0     Jhon   1    Italy    1   145.0  3000.1
1  William   3  Finland    3   129.0  3000.0
2  William   3  Finland    3   159.0  4000.0
3  William   3  Finland    3   109.0  5000.0
4    Snake   4    Italy    4   198.1  4020.2

In [37]:
df1.merge(df2, left_on='ID', right_on='DNI',how="left")

      name  ID  Country  DNI  Weight  Salary
0     Jhon   1    Italy  1.0   145.0  3000.1
1      Pep   2  Germany  NaN     NaN     NaN
2  William   3  Finland  3.0   129.0  3000.0
3  William   3  Finland  3.0   159.0  4000.0
4  William   3  Finland  3.0   109.0  5000.0
5    Snake   4    Italy  4.0   198.1  4020.2

In [38]:
df1.merge(df2, left_on='ID', right_on='DNI',how="right")

      name   ID  Country  DNI  Weight  Salary
0     Jhon  1.0    Italy    1   145.0  3000.1
1  William  3.0  Finland    3   129.0  3000.0
2  William  3.0  Finland    3   159.0  4000.0
3  William  3.0  Finland    3   109.0  5000.0
4    Snake  4.0    Italy    4   198.1  4020.2
5      NaN  NaN      NaN    5   200.0  5000.2

In [39]:
df1.merge(df2, left_on='ID', right_on='DNI',how="inner")

      name  ID  Country  DNI  Weight  Salary
0     Jhon   1    Italy    1   145.0  3000.1
1  William   3  Finland    3   129.0  3000.0
2  William   3  Finland    3   159.0  4000.0
3  William   3  Finland    3   109.0  5000.0
4    Snake   4    Italy    4   198.1  4020.2

In [40]:
df1.merge(df2,how="cross")

       name  ID  Country  DNI  Weight  Salary
0      Jhon   1    Italy    1   145.0  3000.1
1      Jhon   1    Italy    3   129.0  3000.0
2      Jhon   1    Italy    3   159.0  4000.0
3      Jhon   1    Italy    3   109.0  5000.0
4      Jhon   1    Italy    4   198.1  4020.2
5      Jhon   1    Italy    5   200.0  5000.2
6       Pep   2  Germany    1   145.0  3000.1
7       Pep   2  Germany    3   129.0  3000.0
8       Pep   2  Germany    3   159.0  4000.0
9       Pep   2  Germany    3   109.0  5000.0
10      Pep   2  Germany    4   198.1  4020.2
11      Pep   2  Germany    5   200.0  5000.2
12  William   3  Finland    1   145.0  3000.1
13  William   3  Finland    3   129.0  3000.0
14  William   3  Finland    3   159.0  4000.0
15  William   3  Finland    3   109.0  5000.0
16  William   3  Finland    4   198.1  4020.2
17  William   3  Finland    5   200.0  5000.2
18    Snake   4    Italy    1   145.0  3000.1
19    Snake   4    Italy    3   129.0  3000.0
20    Snake   4    Italy    3   159.0  4000.0
21    Snake   4    Italy    3   109.0  5000.0
22    Snake   4    Italy    4   198.1  4020.2
23    Snake   4    Italy    5   200.0  5000.2

In [42]:
# read file csv
import pandas as pd
df_who = pd.read_csv("WHO.csv")
df_who.head()

,Country,CountryID,Continent,Adolescent fertility rate (%),Adult literacy rate (%),Gross national income per capita (PPP international $),Net primary school enrolment ratio female (%),Net primary school enrolment ratio male (%),Population (in thousands) total,Population annual growth rate (%),...,Total_CO2_emissions,Total_income,Total_reserves,Trade_balance_goods_and_services,Under_five_mortality_from_CME,Under_five_mortality_from_IHME,Under_five_mortality_rate,Urban_population,Urban_population_growth,Urban_population_pct_of_total
0,Afghanistan,1,1,151.0,28.0,NaN,NaN,NaN,26088.0,4.0,...,692.50,NaN,NaN,NaN,257.00,231.9,257.00,5740436.0,5.44,22.9
1,Albania,2,2,27.0,98.7,6000.0,93.0,94.0,3172.0,0.6,...,3499.12,4.790000e+09,78.14,-2.040000e+09,18.47,15.5,18.47,1431793.9,2.21,45.4
2,Algeria,3,3,6.0,69.9,5940.0,94.0,96.0,33351.0,1.5,...,137535.56,6.970000e+10,351.36,4.700000e+09,40.00,31.2,40.00,20800000.0,2.61,63.3
3,Andorra,4,2,NaN,NaN,NaN,83.0,83.0,74.0,1.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Angola,5,3,146.0,67.4,3890.0,49.0,51.0,16557.0,2.8,...,8991.46,1.490000e+10,27.13,9.140000e+09,164.10,242.5,164.10,8578749.0,4.14,53.3

In [ ]:
#1.¿Cuál és la media de la población urbana (“Urban_population”) de todos los países? ¿Su desviación típica (std)?

In [43]:
df_who["Urban_population"].mean()

np.float64(16657626.767446807)

In [44]:
df_who["Urban_population"].std()

np.float64(50948665.823935635)

In [ ]:
#2) Consulta la fila del país: “Spain”

In [45]:
df_who[df_who["Country"]=="Spain"]

,Country,CountryID,Continent,Adolescent fertility rate (%),Adult literacy rate (%),Gross national income per capita (PPP international $),Net primary school enrolment ratio female (%),Net primary school enrolment ratio male (%),Population (in thousands) total,Population annual growth rate (%),...,Total_CO2_emissions,Total_income,Total_reserves,Trade_balance_goods_and_services,Under_five_mortality_from_CME,Under_five_mortality_from_IHME,Under_five_mortality_rate,Urban_population,Urban_population_growth,Urban_population_pct_of_total
168,Spain,169,2,10.0,97.2,28200.0,99.0,100.0,43887.0,1.1,...,343701.53,6.780000e+11,NaN,-5.770000e+10,4.9,4.2,4.9,33300000.0,1.75,76.7

In [ ]:
#3a) ¿Qué país tiene una mayor población urbana?

In [46]:
df_who[df_who["Urban_population"] == df_who["Urban_population"].max()]

,Country,CountryID,Continent,Adolescent fertility rate (%),Adult literacy rate (%),Gross national income per capita (PPP international $),Net primary school enrolment ratio female (%),Net primary school enrolment ratio male (%),Population (in thousands) total,Population annual growth rate (%),...,Total_CO2_emissions,Total_income,Total_reserves,Trade_balance_goods_and_services,Under_five_mortality_from_CME,Under_five_mortality_from_IHME,Under_five_mortality_rate,Urban_population,Urban_population_growth,Urban_population_pct_of_total
36,China,37,7,3.0,90.9,4660.0,96.0,100.0,1328474.0,0.6,...,5547757.5,1.890000e+12,295.23,1.250000e+11,27.3,27.8,27.3,527000000.0,2.95,40.4

In [ ]:
#4) ¿El continente donde está situado Spain es el mismo que el de `United States of America?

In [47]:
sample_spain = df_who[df_who["Country"]=="Spain"]
sample_spain

,Country,CountryID,Continent,Adolescent fertility rate (%),Adult literacy rate (%),Gross national income per capita (PPP international $),Net primary school enrolment ratio female (%),Net primary school enrolment ratio male (%),Population (in thousands) total,Population annual growth rate (%),...,Total_CO2_emissions,Total_income,Total_reserves,Trade_balance_goods_and_services,Under_five_mortality_from_CME,Under_five_mortality_from_IHME,Under_five_mortality_rate,Urban_population,Urban_population_growth,Urban_population_pct_of_total
168,Spain,169,2,10.0,97.2,28200.0,99.0,100.0,43887.0,1.1,...,343701.53,6.780000e+11,NaN,-5.770000e+10,4.9,4.2,4.9,33300000.0,1.75,76.7

In [48]:
sample_eeuu = df_who[df_who["Country"]=="United States of America"]
sample_eeuu

,Country,CountryID,Continent,Adolescent fertility rate (%),Adult literacy rate (%),Gross national income per capita (PPP international $),Net primary school enrolment ratio female (%),Net primary school enrolment ratio male (%),Population (in thousands) total,Population annual growth rate (%),...,Total_CO2_emissions,Total_income,Total_reserves,Trade_balance_goods_and_services,Under_five_mortality_from_CME,Under_five_mortality_from_IHME,Under_five_mortality_rate,Urban_population,Urban_population_growth,Urban_population_pct_of_total
192,United States of America,193,4,43.0,NaN,44070.0,93.0,91.0,302841.0,1.0,...,5776431.5,1.100000e+13,NaN,-7.140000e+11,8.0,7.1,8.0,240000000.0,1.39,80.8

In [49]:
sample_spain["Continent"].values[0] == sample_eeuu["Continent"].values[0]

np.False_

In [74]:
df_who.head()
df_who

,Country,CountryID,Continent,Adolescent fertility rate (%),Adult literacy rate (%),Gross national income per capita (PPP international $),Net primary school enrolment ratio female (%),Net primary school enrolment ratio male (%),Population (in thousands) total,Population annual growth rate (%),...,Total_CO2_emissions,Total_income,Total_reserves,Trade_balance_goods_and_services,Under_five_mortality_from_CME,Under_five_mortality_from_IHME,Under_five_mortality_rate,Urban_population,Urban_population_growth,Urban_population_pct_of_total
0,Afghanistan,1,1,151.0,28.0,NaN,NaN,NaN,26088.0,4.0,...,692.50,NaN,NaN,NaN,257.00,231.9,257.00,5740436.0,5.44,22.9
1,Albania,2,2,27.0,98.7,6000.0,93.0,94.0,3172.0,0.6,...,3499.12,4.790000e+09,78.14,-2.040000e+09,18.47,15.5,18.47,1431793.9,2.21,45.4
2,Algeria,3,3,6.0,69.9,5940.0,94.0,96.0,33351.0,1.5,...,137535.56,6.970000e+10,351.36,4.700000e+09,40.00,31.2,40.00,20800000.0,2.61,63.3
3,Andorra,4,2,NaN,NaN,NaN,83.0,83.0,74.0,1.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Angola,5,3,146.0,67.4,3890.0,49.0,51.0,16557.0,2.8,...,8991.46,1.490000e+10,27.13,9.140000e+09,164.10,242.5,164.10,8578749.0,4.14,53.3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
197,Vietnam,198,6,25.0,90.3,2310.0,91.0,96.0,86206.0,1.4,...,101826.23,4.480000e+10,47.11,-1.940000e+09,20.20,23.4,20.20,21900000.0,2.90,26.4
198,West Bank and Gaza,199,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,655.86,3.780000e+09,NaN,NaN,28.00,25.8,28.00,2596216.0,3.33,71.6
199,Yemen,200,1,83.0,54.1,2090.0,65.0,85.0,21732.0,3.0,...,20148.34,1.150000e+10,114.52,8.310000e+08,82.40,87.9,82.40,5759120.5,4.37,27.3
200,Zambia,201,3,161.0,68.0,1140.0,94.0,90.0,11696.0,1.9,...,2366.94,4.090000e+09,10.41,-4.470000e+08,175.30,163.8,175.30,4017411.0,1.95,35.0
201,Zimbabwe,202,3,101.0,89.5,NaN,88.0,87.0,13228.0,0.8,...,11457.33,5.620000e+09,3.39,-1.710000e+08,106.50,67.0,106.50,4709965.0,1.90,35.9

In [67]:
#5) ¿Cuáles son los cinco paises más contaminantes (“Total_CO2_emissions”)?
#Esta es mi pista para una solución elegante: http://pandas.pydata.org/pandas-docs/version/0.19.2/generated/pandas.DataFrame.sort_values.html
result = df_who.sort_values(by="Total_CO2_emissions", ascending=False).head(5)
result

,Country,CountryID,Continent,Adolescent fertility rate (%),Adult literacy rate (%),Gross national income per capita (PPP international $),Net primary school enrolment ratio female (%),Net primary school enrolment ratio male (%),Population (in thousands) total,Population annual growth rate (%),...,Total_CO2_emissions,Total_income,Total_reserves,Trade_balance_goods_and_services,Under_five_mortality_from_CME,Under_five_mortality_from_IHME,Under_five_mortality_rate,Urban_population,Urban_population_growth,Urban_population_pct_of_total
192,United States of America,193,4,43.0,NaN,44070.0,93.0,91.0,302841.0,1.0,...,5776431.5,1.100000e+13,NaN,-7.140000e+11,8.00,7.1,8.00,240000000.0,1.39,80.8
36,China,37,7,3.0,90.9,4660.0,96.0,100.0,1328474.0,0.6,...,5547757.5,1.890000e+12,295.23,1.250000e+11,27.30,27.8,27.30,527000000.0,2.95,40.4
149,Russia,150,2,28.0,99.4,12740.0,91.0,91.0,143221.0,-0.5,...,1503302.5,3.500000e+11,79.57,1.040000e+11,18.30,20.5,18.30,104000000.0,-0.60,73.0
79,India,80,7,97.0,61.0,2460.0,87.0,90.0,1151751.0,1.5,...,1402359.4,6.440000e+11,111.94,-2.470000e+10,80.21,77.2,80.21,314000000.0,2.07,28.7
87,Japan,88,6,6.0,NaN,32840.0,100.0,100.0,127953.0,0.0,...,1230026.8,4.990000e+12,NaN,6.990000e+10,3.80,3.5,3.80,84100000.0,0.19,65.8

In [ ]:
#6) Observando algunas muestras del fichero puedes establecer la relación entre el identificador del continente y su nombre?
#Es decir, sabemos que Spain está en el continente Europeo y el código del continente es el 2.
#Existen los códigos de continentes: 1, 2, 3, 4, 5, 6, 7
#Nota: Hay dos códigos asociados a Asia.
#Haz las consultas pertinentes al dataframe para construir un diccionario con la siguiente estructura:

In [68]:
codigoContinentes = {1:"Asia",2:"Europa"} #Al menos hay 7!
print(codigoContinentes[2])

Europa

In [69]:
codigoContinentes = {1:"Asia",2:"Europa",3:"", 4:""} # TODO...

In [75]:
df_who[df_who["Continent"] == 6 ]

,Country,CountryID,Continent,Adolescent fertility rate (%),Adult literacy rate (%),Gross national income per capita (PPP international $),Net primary school enrolment ratio female (%),Net primary school enrolment ratio male (%),Population (in thousands) total,Population annual growth rate (%),...,Total_CO2_emissions,Total_income,Total_reserves,Trade_balance_goods_and_services,Under_five_mortality_from_CME,Under_five_mortality_from_IHME,Under_five_mortality_rate,Urban_population,Urban_population_growth,Urban_population_pct_of_total
8,Australia,9,6,16.0,NaN,33940.0,97.0,96.0,20530.0,1.1,...,368858.53,4.680000e+11,NaN,-1.280000e+10,5.90,5.1,5.90,1.800000e+07,1.54,88.2
25,Brunei Darussalam,26,6,31.0,92.7,49900.0,94.0,94.0,382.0,2.1,...,5891.71,4.830000e+09,NaN,NaN,8.80,7.2,8.80,2.747658e+05,2.86,73.5
41,Cook Islands,42,6,NaN,NaN,NaN,75.0,73.0,14.0,-2.5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
59,Fiji,60,6,35.0,NaN,4450.0,91.0,91.0,833.0,0.6,...,1641.47,1.860000e+09,137.36,1.980000e+07,18.10,15.3,18.10,4.206474e+05,1.61,50.8
62,French Polynesia,63,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,685.17,3.450000e+09,NaN,NaN,NaN,NaN,NaN,1.321618e+05,1.20,51.7
76,"Hong Kong, China",77,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,38559.94,2.080000e+11,NaN,2.220000e+10,NaN,NaN,NaN,6.813200e+06,0.37,100.0
80,Indonesia,81,6,54.0,90.4,3310.0,94.0,97.0,228864.0,1.2,...,419593.94,2.080000e+11,26.57,1.150000e+10,38.40,42.7,38.40,1.060000e+08,3.93,48.1
87,Japan,88,6,6.0,NaN,32840.0,100.0,100.0,127953.0,0.0,...,1230026.80,4.990000e+12,NaN,6.990000e+10,3.80,3.5,3.80,8.410000e+07,0.19,65.8
91,Kiribati,92,6,NaN,NaN,6230.0,98.0,96.0,94.0,1.7,...,25.65,5.190000e+07,NaN,-2.080000e+07,66.00,NaN,66.00,4.692600e+04,3.08,47.4
92,"Korea, Dem. Rep.",93,6,0.0,NaN,NaN,NaN,NaN,23708.0,0.4,...,82615.88,NaN,NaN,NaN,55.00,NaN,55.00,1.450000e+07,0.89,61.6
93,"Korea, Rep.",94,6,2.0,NaN,22990.0,93.0,100.0,48050.0,0.4,...,452218.22,6.390000e+11,NaN,1.900000e+10,5.08,6.8,5.08,3.900000e+07,0.74,80.8
96,Lao People's Democratic Republic,97,6,110.0,68.7,1740.0,81.0,86.0,5759.0,1.7,...,1432.62,2.350000e+09,11.49,-8.230000e+07,83.40,84.3,83.40,1.166766e+06,3.27,20.6
104,"Macao, China",105,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,2235.04,1.040000e+10,NaN,4.250000e+09,NaN,NaN,NaN,4.730900e+05,1.16,100.0
108,Malaysia,109,6,12.0,88.7,12160.0,100.0,100.0,26114.0,1.8,...,239834.45,1.120000e+11,135.55,3.080000e+10,12.40,6.1,12.40,1.730000e+07,3.46,67.3
112,Marshall Islands,113,6,NaN,NaN,8040.0,66.0,67.0,58.0,2.2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
116,Micronesia (Federated States of),117,6,44.0,NaN,6070.0,NaN,NaN,111.0,0.5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
119,Mongolia,120,6,28.0,97.8,2810.0,93.0,90.0,2605.0,0.9,...,8789.94,1.250000e+09,32.44,-9.080000e+07,50.90,39.7,50.90,1.448118e+06,1.59,56.7
123,Myanmar,124,6,29.0,89.9,510.0,100.0,99.0,48379.0,0.9,...,11314.43,NaN,13.38,7.230000e+08,106.00,98.8,106.00,1.470000e+07,2.56,30.6
125,Nauru,126,6,NaN,NaN,NaN,NaN,NaN,10.0,0.2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
129,New Caledonia,130,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,2638.08,2.680000e+09,NaN,NaN,NaN,NaN,NaN,1.493634e+05,2.47,63.7
130,New Zealand,131,6,27.0,NaN,25750.0,99.0,99.0,4140.0,1.0,...,29945.87,6.270000e+10,NaN,-2.560000e+09,6.70,6.1,6.70,3.563422e+06,1.24,86.2
134,Niue,135,6,NaN,NaN,NaN,98.0,99.0,2.0,-2.2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
138,Palau,139,6,NaN,NaN,14340.0,94.0,98.0,20.0,0.5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
140,Papua New Guinea,141,6,77.0,57.3,1630.0,NaN,NaN,6202.0,2.2,...,4437.10,3.700000e+09,39.79,8.880000e+08,69.40,83.6,69.40,8.133411e+05,2.54,13.4
143,Philippines,144,6,55.0,92.6,3430.0,92.0,90.0,86264.0,2.0,...,74958.11,9.440000e+10,29.93,-9.110000e+09,31.50,30.9,31.50,5.300000e+07,3.38,62.7
154,Samoa,155,6,45.0,98.6,5090.0,91.0,90.0,185.0,0.8,...,150.22,2.860000e+08,12.46,-1.160000e+08,29.98,NaN,29.98,4.118128e+04,1.18,22.4
162,Singapore,163,6,7.0,92.5,43300.0,77.0,77.0,4382.0,1.3,...,56275.38,1.130000e+11,NaN,3.490000e+10,3.00,3.0,3.00,4.341800e+06,2.41,100.0
165,Solomon Islands,166,6,72.0,NaN,1850.0,61.0,62.0,484.0,2.4,...,175.87,3.230000e+08,57.36,2.330000e+07,77.70,NaN,77.70,8.031123e+04,4.02,17.0
176,Taiwan,177,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,245806.77,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
179,Thailand,180,6,70.0,92.6,7440.0,94.0,94.0,63444.0,0.7,...,270894.20,1.570000e+11,100.87,-3.750000e+09,9.00,13.7,9.00,2.030000e+07,1.44,32.3
180,Timor-Leste,181,6,49.0,NaN,5100.0,67.0,70.0,1114.0,4.3,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
182,Tonga,183,6,17.0,98.9,5470.0,94.0,97.0,100.0,0.5,...,117.25,1.670000e+08,57.30,-9.460000e+07,24.48,NaN,24.48,2.384664e+04,1.04,24.0
187,Tuvalu,188,6,NaN,NaN,NaN,NaN,NaN,10.0,0.4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
195,Vanuatu,196,6,92.0,75.5,3480.0,86.0,88.0,221.0,2.5,...,87.94,2.560000e+08,81.85,-3.740000e+07,39.94,43.0,39.94,5.061101e+04,4.11,23.5
197,Vietnam,198,6,25.0,90.3,2310.0,91.0,96.0,86206.0,1.4,...,101826.23,4.480000e+10,47.11,-1.940000e+09,20.20,23.4,20.20,2.190000e+07,2.90,26.4

In [83]:
#7) Una vez identificado el nombre de los continentes, 
#¿puedes cambiar la columna de identificadores de continentes por sus respectivos nombres?

df_who.loc[df_who["Continent"] == 1, "Continent"] = "Eurasia"
df_who

,Country,CountryID,Continent,Adolescent fertility rate (%),Adult literacy rate (%),Gross national income per capita (PPP international $),Net primary school enrolment ratio female (%),Net primary school enrolment ratio male (%),Population (in thousands) total,Population annual growth rate (%),...,Total_CO2_emissions,Total_income,Total_reserves,Trade_balance_goods_and_services,Under_five_mortality_from_CME,Under_five_mortality_from_IHME,Under_five_mortality_rate,Urban_population,Urban_population_growth,Urban_population_pct_of_total
0,Afghanistan,1,Eurasia,151.0,28.0,NaN,NaN,NaN,26088.0,4.0,...,692.50,NaN,NaN,NaN,257.00,231.9,257.00,5740436.0,5.44,22.9
1,Albania,2,2,27.0,98.7,6000.0,93.0,94.0,3172.0,0.6,...,3499.12,4.790000e+09,78.14,-2.040000e+09,18.47,15.5,18.47,1431793.9,2.21,45.4
2,Algeria,3,3,6.0,69.9,5940.0,94.0,96.0,33351.0,1.5,...,137535.56,6.970000e+10,351.36,4.700000e+09,40.00,31.2,40.00,20800000.0,2.61,63.3
3,Andorra,4,2,NaN,NaN,NaN,83.0,83.0,74.0,1.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Angola,5,3,146.0,67.4,3890.0,49.0,51.0,16557.0,2.8,...,8991.46,1.490000e+10,27.13,9.140000e+09,164.10,242.5,164.10,8578749.0,4.14,53.3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
197,Vietnam,198,6,25.0,90.3,2310.0,91.0,96.0,86206.0,1.4,...,101826.23,4.480000e+10,47.11,-1.940000e+09,20.20,23.4,20.20,21900000.0,2.90,26.4
198,West Bank and Gaza,199,Eurasia,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,655.86,3.780000e+09,NaN,NaN,28.00,25.8,28.00,2596216.0,3.33,71.6
199,Yemen,200,Eurasia,83.0,54.1,2090.0,65.0,85.0,21732.0,3.0,...,20148.34,1.150000e+10,114.52,8.310000e+08,82.40,87.9,82.40,5759120.5,4.37,27.3
200,Zambia,201,3,161.0,68.0,1140.0,94.0,90.0,11696.0,1.9,...,2366.94,4.090000e+09,10.41,-4.470000e+08,175.30,163.8,175.30,4017411.0,1.95,35.0
201,Zimbabwe,202,3,101.0,89.5,NaN,88.0,87.0,13228.0,0.8,...,11457.33,5.620000e+09,3.39,-1.710000e+08,106.50,67.0,106.50,4709965.0,1.90,35.9

In [101]:
#8) Puedes crear un nuevo dataframe con aquellos paises que sean de Europa?
df_who[df_who["Continent" == 2]]

KeyError: False

In [98]:
df_who.sort_values("Total_CO2_emissions", ascending=False).head()

,Country,CountryID,Continent,Adolescent fertility rate (%),Adult literacy rate (%),Gross national income per capita (PPP international $),Net primary school enrolment ratio female (%),Net primary school enrolment ratio male (%),Population (in thousands) total,Population annual growth rate (%),...,Total_CO2_emissions,Total_income,Total_reserves,Trade_balance_goods_and_services,Under_five_mortality_from_CME,Under_five_mortality_from_IHME,Under_five_mortality_rate,Urban_population,Urban_population_growth,Urban_population_pct_of_total
192,United States of America,193,4,43.0,NaN,44070.0,93.0,91.0,302841.0,1.0,...,5776431.5,1.100000e+13,NaN,-7.140000e+11,8.00,7.1,8.00,240000000.0,1.39,80.8
36,China,37,7,3.0,90.9,4660.0,96.0,100.0,1328474.0,0.6,...,5547757.5,1.890000e+12,295.23,1.250000e+11,27.30,27.8,27.30,527000000.0,2.95,40.4
149,Russia,150,2,28.0,99.4,12740.0,91.0,91.0,143221.0,-0.5,...,1503302.5,3.500000e+11,79.57,1.040000e+11,18.30,20.5,18.30,104000000.0,-0.60,73.0
79,India,80,7,97.0,61.0,2460.0,87.0,90.0,1151751.0,1.5,...,1402359.4,6.440000e+11,111.94,-2.470000e+10,80.21,77.2,80.21,314000000.0,2.07,28.7
87,Japan,88,6,6.0,NaN,32840.0,100.0,100.0,127953.0,0.0,...,1230026.8,4.990000e+12,NaN,6.990000e+10,3.80,3.5,3.80,84100000.0,0.19,65.8

In [ ]:
#9) ¿Cuáles son los paises más contaminantes de Europa?

In [108]:
#10) Calcula la cantidad de ayuda recibida por cada municipio en función del número total de habitantes.
import pandas as pd
import random

random.seed(0)

nombres = [f'Municipio{i}' for i in range(1, 11)]

data_municipios = {
    'Nombre': nombres,
    'Código Postal': [random.randint(10000, 99999) for _ in range(10)],
    'Población': [random.randint(1000, 50000) for _ in range(10)]  # Añadimos un atributo aleatorio, en este caso "Población"
}

df_municipios = pd.DataFrame(data_municipios)


data_ayudas = {
    'Nombre':  [f'Municipio{i}' for i in range(1, 11)],
    'Ayuda Económica (en euros)': [random.randint(1000, 10000) for _ in range(10)],
    'Número de Beneficiarios': [random.randint(10, 100) for _ in range(10)]
}

df_ayudas = pd.DataFrame(data_ayudas)

print("Dataframe de Municipios:")
print(df_municipios)

print("\nDataframe de Ayudas:")
print(df_ayudas)

df_merged = pd.merge(df_municipios, df_ayudas, on="Nombre")
df_merged["Ayuda por Habitante (€)"] = (
    df_merged["Ayuda Económica (en euros)"] / df_merged["Población"]
)
df_result = df_merged[["Nombre", "Población", "Ayuda Económica (en euros)", "Ayuda por Habitante (€)"]]
print(df_result)

Dataframe de Municipios:
        Nombre  Código Postal  Población
0   Municipio1          60494      39232
1   Municipio2          65125      15315
2   Municipio3          15306      34075
3   Municipio4          43936      10127
4   Municipio5          77013      19470
5   Municipio6          73691      10158
6   Municipio7          63075       7214
7   Municipio8          49755      41525
8   Municipio9          72468      17417
9  Municipio10          56930      35902

Dataframe de Ayudas:
        Nombre  Ayuda Económica (en euros)  Número de Beneficiarios
0   Municipio1                        3407                       88
1   Municipio2                        6081                       91
2   Municipio3                        2618                       36
3   Municipio4                        2208                       80
4   Municipio5                        6409                       71
5   Municipio6                        8735                       66
6   Municipio7                        2649                       76
7   Municipio8                        6796                       43
8   Municipio9                        8113                       17
9  Municipio10                        6180                       80
        Nombre  Población  Ayuda Económica (en euros)  Ayuda por Habitante (€)
0   Municipio1      39232                        3407                 0.086842
1   Municipio2      15315                        6081                 0.397062
2   Municipio3      34075                        2618                 0.076831
3   Municipio4      10127                        2208                 0.218031
4   Municipio5      19470                        6409                 0.329173
5   Municipio6      10158                        8735                 0.859913
6   Municipio7       7214                        2649                 0.367203
7   Municipio8      41525                        6796                 0.163660
8   Municipio9      17417                        8113                 0.465809
9  Municipio10      35902                        6180                 0.172135

In [112]:
df_nou = df_municipios.merge(df_ayudas,on="Nombre")
df_nou["Ayuda por persona"] = df_nou["Ayuda Económica (en euros)"] / df_nou["Población"]
df_nou

,Nombre,Código Postal,Población,Ayuda Económica (en euros),Número de Beneficiarios,Ayuda por persona
0,Municipio1,60494,39232,3407,88,0.086842
1,Municipio2,65125,15315,6081,91,0.397062
2,Municipio3,15306,34075,2618,36,0.076831
3,Municipio4,43936,10127,2208,80,0.218031
4,Municipio5,77013,19470,6409,71,0.329173
5,Municipio6,73691,10158,8735,66,0.859913
6,Municipio7,63075,7214,2649,76,0.367203
7,Municipio8,49755,41525,6796,43,0.163660
8,Municipio9,72468,17417,8113,17,0.465809
9,Municipio10,56930,35902,6180,80,0.172135

In [109]:
#Usando el fichero climaMallorca.csv, se pide: 
#11) ¿Cual es la temperatura máxima cuando el viento es inferior a 10? ¿Cuántas muestras hay?